1c/src/Catalogs/АбонементыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АбонементыКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заморожен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/src/Catalogs/АбонементыКлиентов/Forms/ФормаЭлемента/Ext/Form.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Активен       = Истина;
		Объект.Заморожен     = Ложь;
		Объект.ДатаНачала    = НачалоДня(ТекущаяДата());
		Объект.ДатаОкончания = КонецДня(ДобавитьМесяц(ТекущаяДата(), 1));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ВидАбонементаПриИзменении(Элемент)
	ЗаполнитьПоВидуАбонементаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВидуАбонементаНаСервере()
	Если Объект.ВидАбонемента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ВидАб = Объект.ВидАбонемента.ПолучитьОбъект();
	Объект.ОстатокПосещений  = ВидАб.КоличествоПосещений;
	ДнейДействия             = ВидАб.СрокДействияВДнях - 1;
	Объект.ДатаОкончания     = КонецДня(Объект.ДатаНачала + ДнейДействия * 86400);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеСправочника_АбонементыКлиентов");
КонецПроцедуры

#КонецОбласти
